In [122]:
# ------------------------------------------------------------
# Create a DataFrame
# ------------------------------------------------------------
# Create a DataFrame with columns: Name, Age, and Marks
# Include 4 student records with at least one missing value.
# (Hint: Use a dictionary and pd.DataFrame())
# ------------------------------------------------------------

import pandas as pd

a = {
    "Name":["Babu","Hari","Meena","Ravi"],
    "Age":[20,30,40,None],
    "Marks":[80,50,60,None]
}

df = pd.DataFrame(a)
df

    Name   Age  Marks
0   Babu  20.0   80.0
1   Hari  30.0   50.0
2  Meena  40.0   60.0
3   Ravi   NaN    NaN

In [123]:
# ------------------------------------------------------------
#  Add a new column
# ------------------------------------------------------------
# Add a new column "Grade" with letter grades (A, B, C, etc.)
# ------------------------------------------------------------

df['Grade']=["A","C","B","A"]
df

    Name   Age  Marks Grade
0   Babu  20.0   80.0     A
1   Hari  30.0   50.0     C
2  Meena  40.0   60.0     B
3   Ravi   NaN    NaN     A

In [124]:
# ------------------------------------------------------------
# ⿣ Access specific columns
# ------------------------------------------------------------
# Display only the 'Name' and 'Marks' columns.
# ------------------------------------------------------------


df[['Name','Marks']]

    Name  Marks
0   Babu   80.0
1   Hari   50.0
2  Meena   60.0
3   Ravi    NaN

In [125]:
# ------------------------------------------------------------
# ⿤ Count missing values
# ------------------------------------------------------------
# Count the number of missing values in each column.
# (Hint: df.isnull().sum())
# ------------------------------------------------------------


df.isnull().sum()

Name     0
Age      1
Marks    1
Grade    0
dtype: int64

In [126]:
# ------------------------------------------------------------
# ⿥ Handle missing values
# ------------------------------------------------------------
# Replace all missing values in 'Age' with the mean age.
# (Hint: df['Age'].fillna(df['Age'].mean(), inplace=True))
# ------------------------------------------------------------

df.fillna({'Age':df['Age'].mean()},inplace=True)
df

    Name   Age  Marks Grade
0   Babu  20.0   80.0     A
1   Hari  30.0   50.0     C
2  Meena  40.0   60.0     B
3   Ravi  30.0    NaN     A

In [127]:
# ------------------------------------------------------------
#  Modify a specific cell
# ------------------------------------------------------------
# Change the Name in the 3rd row (index 2) to 'Sonu'.
# (Hint: df.loc[2, 'Name'] = 'Sonu')
# ------------------------------------------------------------

df.loc[2,'Name']='Sonu'
df

   Name   Age  Marks Grade
0  Babu  20.0   80.0     A
1  Hari  30.0   50.0     C
2  Sonu  40.0   60.0     B
3  Ravi  30.0    NaN     A

In [128]:
# ⿧ Add new rows to the DataFrame
# ------------------------------------------------------------
# Add two new rows:
# {'Name': 'Kumar', 'Age': 20, 'Marks': 90}
# {'Name': 'Rahul', 'Age': 26, 'Marks': 85}
# (Hint: Use pd.concat)
# -----------------------------------------------------------

b = pd.DataFrame([
    {'Name': 'Kumar', 'Age': 20, 'Marks': 90},
    {'Name': 'Rahul', 'Age': 26, 'Marks': 85}
])

df = pd.concat([df,b],ignore_index=True)
df

    Name   Age  Marks Grade
0   Babu  20.0   80.0     A
1   Hari  30.0   50.0     C
2   Sonu  40.0   60.0     B
3   Ravi  30.0    NaN     A
4  Kumar  20.0   90.0   NaN
5  Rahul  26.0   85.0   NaN

In [129]:
# ------------------------------------------------------------
# ⿨ Access data using loc
# ------------------------------------------------------------
# Access and print 'Name' and 'Marks' for the student at index 0.
# (Hint: df.loc[0, ['Name', 'Marks']])
# ------------------------------------------------------------

df.loc[0,['Name','Marks']]

Name     Babu
Marks    80.0
Name: 0, dtype: object

In [130]:
# ------------------------------------------------------------
# ⿩ Slicing rows and columns using loc
# ------------------------------------------------------------
# Display 'Name' and 'Marks' for rows 0 to 3.
# (Hint: df.loc[0:3, ['Name', 'Marks']])
# ------------------------------------------------------------

df.loc[0:3,['Name','Marks']]

   Name  Marks
0  Babu   80.0
1  Hari   50.0
2  Sonu   60.0
3  Ravi    NaN

In [131]:
# ------------------------------------------------------------
#  Access rows and columns using iloc
# ------------------------------------------------------------
# Display the first and third rows, and first two columns.
# (Hint: df.iloc[0:3:2, 0:2])

df.iloc[0:3:2, 0:2]

   Name   Age
0  Babu  20.0
2  Sonu  40.0

In [132]:
# ------------------------------------------------------------
# ⿡⿡ Aggregate functions
# ------------------------------------------------------------
# Calculate and display:
# - Mean Age
# - Minimum Age
# - Maximum Age
# - Count of Age values
# ------------------------------------------------------------

print(df['Age'].mean())
print(df['Age'].min())
print(df['Age'].max())
print(df['Age'].count())

27.666666666666668
20.0
40.0
6

In [133]:
# ------------------------------------------------------------
# ⿡⿢ Grouping and aggregation
# ------------------------------------------------------------
# Group the DataFrame by 'Name' and compute the mean Age for each Name.
# (Hint: df.groupby('Name')['Age'].mean())
# ------------------------------------------------------------

df.groupby('Name')['Age'].mean()

Name
Babu     20.0
Hari     30.0
Kumar    20.0
Rahul    26.0
Ravi     30.0
Sonu     40.0
Name: Age, dtype: float64

In [134]:
# ------------------------------------------------------------
#  Bonus Challenge
# ------------------------------------------------------------
# Sort the DataFrame by 'Marks' in descending order and
# display the top 3 students.
# (Hint: df.sort_values(by='Marks', ascending=False).head(3)

df.sort_values('Marks',ascending=False).head(3)

    Name   Age  Marks Grade
4  Kumar  20.0   90.0   NaN
5  Rahul  26.0   85.0   NaN
0   Babu  20.0   80.0     A

In [135]:
group = df.groupby('Name')
print(group['Age'].mean())

Name
Babu     20.0
Hari     30.0
Kumar    20.0
Rahul    26.0
Ravi     30.0
Sonu     40.0
Name: Age, dtype: float64